---
layout: post
title: "ال10 أشياء التي لا نتعلمها في المدرسة حسب بيل غاتس"
date: 2013-08-30 13:44
comments: true
categories: نصائح، التعلم، تطوير الذات، ريادة
---


قام بيل غاتس مؤخرا بإلقاء خطاب في مدرسة ثانوية بخصوص 10 أشياء لا نتعلمها في المدرسة و التي من الضروري تعلمها و بسرعة. يمكنكم عدم  الموافقة على هذه النصائح و لكن ما هو مؤكد أن بيل غاتس قد طبقها على نفسه و تعلمها و ساعدته في حياته الحافلة :

العلاقة الأولى :
----------------------

الحياة ليست عادلة و هذا شيئ يجب عليكم التعود عليه

العلاقة الثانية :
----------------------

العالم لا يهتم كثيرا بما تحبونه و تريدونه، العالم ينتظر منكم أن تقدمو شيئ قبل أن يهنئكم.

العلاقة الثالثة :
----------------------

لن تربحو 60000 دولار فور تخرجكم من المدرسة أو الجامعة، ان تكونو مدراء تركبون سيارات بسواق و GSM داخل السيارة. يجب استحقاق النجاح قبل الاستمتاع به.

العلاقة الرابعة :
----------------------

لو تظنون أن استاذكم قاسي معكم فانتظرو رؤية مدير عملكم.

العلاقة الخامسة :
----------------------

العمل في مطعم ليس عيبا، اجدادكم كان يطلقون عليه تسمية مختلفة : فرصة لا تعوض.

العلاقة السادسة :
----------------------

عندما تخطؤن فهذا ليس بسبب الآخرين و لكن يجب التوقف على التدمر و التعلم من الأخطاء
العلاقة السابعة :

----------------------
قبل ولادتكم حياة أباكم كانت أجمل بكثير من ما هي عليه و هذا ل:
- ما كا نو يدفعون أموال لأجلكم
- ما كانو يغسلون ثيابا سوى ثيابهم
- و استماعهم يوميا لمدحكم أنفسكم

لهذا و قبل حماية الغابات الاستوائية من الأخطار المختلفة، حاولو البدأ بتنظيف غرفكم و كل ما بوسعكم عمله في مساعدتهم في حياتهم اليومية.

العلاقة الثامنة:
----------------------

في بعض المدارس، تم الغاء نظام "رابح-خاسر" فهناك مدارس ألغت تماما نظام الامتحانات حتى تعطي حظ كبير للتلاميذ، هذا النظام لن تعطيه  لكم الحياة.

العلاقة التاسعة :
----------------------

الحياة  ليست مقسمة لفصول مثل العام الدراسي، و العطلة الصيفية ليس لها معنى في الحياة اليومية، أي عند بدأ العمل لا تنتظرو عطلة أو راحة فالمسؤولية لا تتماشى مع العطل.

العلاقة العاشرة :
----------------------

التلفزيون لا يمثل الحياة الحقيقة أبدا. في الحياة الحقيقية الناس يتركون المقاهي للعمل ليس العكس…

إذا أعجبتكم هذه النصائح و تعتقدون أنها مفيدة انشروها
