---
layout: post
title: تطبيق عملي لقياس سرعةالكود بروبي
date: 2013-08-02 19:56
comments: true
categories: ruby, benchmark, fibonacci
---
في هذا المقال و كتطبيق وتتمة للمقال السابق سنقوم بدراسة بسيطة نقوم من خلالهابمقارنة أسرع خوارزمية لحساب متتالية fibonacci المعروفة.

في المثال سنستعمل طريقتين لحساب المتتالية و نقوم  بمقارنة الأسرع بينهما من خلال تطبيق ما شرحناه في المقال السابق حول الbenchmarking.

متتالية فيبوناتشي أو أعداد فيبوناتشي في الرياضيات هي الأرقام التي تكون في المتتالية التالية: 

0,1,1,2,3,5,8,13,21...

و التي تحسب يالطريقة  التالية :

Fn=Fn-1 + Fn-2

مع القيم الناتجة منها : F0=1 و F1=1


في المثال سنقوم بعرض طريقتين :  الأولى باستعمال المقارنة العادية  و الثانية باستعمال include كما هو موضح  في الصورة. 
<img src="/images/rubyBenchmark/fibonacci_algorithm.png" title="fibonacci_algorithm"/>

لمقارنة و لقياس السرعة  سنقوم باستعمال المقياس benchmark الذي شرحناه سابقا كما هو موضح  في الصورة :


<img src="/images/rubyBenchmark/benchmark_fibonacci.png" title="benchmark_fibonacci"/>


للقياس سنقوم  بتغيير n من خلال أخذ ثلاث قيم مختلفة : 15, 25, 35. النتيجة موضحة في الصورة :

<img src="/images/rubyBenchmark/benchmark_fibonacci_result.png" title="benchmark_fibonacci_result"/>


النتيجة توضح أن وبعد ما يكون n أكبر من 25 نلاحظ تباين في سرعة تنفيذ المتتالية بين الطريقتين بحيث أن الطريقة التي تستعمل الinclude تأخد أكبر وقت من الطريقة التي تستعمل طريقة المقارنة البديهية.

أتمنى بهذا التطبيق و المقال السابق أنها تكونت لديكم فكرة أكثر وضوحا حول استعمال الbenchmarking بروبي.


